---
kind: method
id: M:Autodesk.Revit.DB.ExportLayerTable.GetLayerTableIterator
source: html/c394571c-e0bf-c12c-738c-25d3c52f53ad.htm
---
# Autodesk.Revit.DB.ExportLayerTable.GetLayerTableIterator Method

Returns a LayerTableIterator that iterates through the collection.

## Syntax (C#)
```csharp
public ExportLayerTableIterator GetLayerTableIterator()
```

## Returns
A LayerTableIterator object that can be used to iterate through key-value pairs in the collection.